{
  "debugify.name": "Debugify",
  "debugify.basic": "Основные исправления",
  "debugify.gameplay": "Исправления игрового процесса",
  "debugify.gameplay.warning": "ВНИМАНИЕ: Эта категория содержит исправления, которые могут являться несправедливым преимуществом!",
  "debugify.gameplay.enable_in_multiplayer": "Включить в сетевой игре",
  "debugify.fix.enabled": "Исправлено",
  "debugify.fix.disabled": "Не исправлено",
  "debugify.fix.unavailable": "Недоступно",
  "debugify.error.conflict": "Исправление %s несовместимо с модом «%s»",
  "debugify.error.os": "%s относится только к %s",
  "debugify.os.windows": "Windows",
  "debugify.os.macos": "macOS",
  "debugify.os.linux": "Linux",
  "debugify.os.solaris": "Solaris",
  "debugify.misc": "Разное",
  "debugify.misc.default_disabled": "Отключать по умолчанию",
  "debugify.misc.default_disabled.description": "Все новые исправления будут по умолчанию отключены.",
  "debugify.env.client": "Клиент",
  "debugify.env.client.desc": "Исправления, применимые только к клиенту.",
  "debugify.env.server": "Общие",
  "debugify.env.server.desc": "Исправления, применимые как к клиенту, так и к серверу, а также к общему коду между ними.",
  "debugify.no_yacl.title": "YetAnotherConfigLib не установлен!",
  "debugify.no_yacl.description": "Для настройки Debugify через графический интерфейс требуется мод %s - это библиотека, используемая для предоставленияя данной функции. Иначе вы можете отредактировать настройки мода в JSON файле, хранящемся по пути «%s».",

  "debugify.mc_237493.header": "Телеметрия отключена модом Debugify",
  "debugify.mc_237493.line": "Вы выбрали «%s» в параметре телеметрии, поэтому Debugify предотвращает любое подключение к службам телеметрии Mojang. Это предусмотрено Debugify для исправления MC-237493.",
  "debugify.mc_237493.tooltip.off": "«%s» полностью отключает любое подключение к службам телеметрии Mojang. (Debugify MC-237493)",
  "debugify.mc_237493.tooltip.minimal": "«%s» включает только ту информацию, которую Mojang сочтёт необходимой.",
  "debugify.mc_237493.tooltip.all": "«%s» включает в себя всю минимальную и дополнительную телеметрию."

  "debugify.fix_explanation.mc-55347": "Очищает текст на экране при отключении.",
  "debugify.fix_explanation.mc-79545": "Ограничивает уровень опыта максимальным целым числом только при рендеринге.",
  "debugify.fix_explanation.mc-93384": "Добавляет высоту глаз в место генерации частиц.",
  "debugify.fix_explanation.mc-108948": "Проблема заключается в том, что клиент не выполняет те же вычисления, что и сервер. Когда никто не управляет лодкой, клиент не запускает физику на лодке, вызывая де-синхронизацию клиента. Это исправление просто сообщает клиенту запустить некоторые вычисления физики на лодке.",
  "debugify.fix_explanation.mc-111516": "Изменяет вычисление acos для математических расчетов так, чтобы результат не превышал 1.0",
  "debugify.fix_explanation.mc-112730": "Не добавляет маяки и другие блок-сущности в список локального рендерера блоков, если они уже добавлены в глобальный список."
  "debugify.fix_explanation.mc-122477": "Предотвращает первые два опроса клавиатуры после инициализации окна редактирования, например окна чата.",
  "debugify.fix_explanation.mc-123739": "Сортирует записи в книге рецептов по их идентификаторам.",
  "debugify.fix_explanation.mc-143474": "Копирует выбранный слот при создании нового локального игрока после возрождения.",
  "debugify.fix_explanation.mc-159163": "Удаляет данные о позе из обработки пакета данных сущности.",
  "debugify.fix_effect.mc-159163": "Это предотвратит синхронизацию клиентом данных позы с сервером и будет использовать клиент исключительно для определения позы.",
  "debugify.fix_explanation.mc-162253": "Прекращает обновление света с клиента при входе в чанк.",
  "debugify.fix_explanation.mc-165381": "Отменяет разрушение блока, когда клиент выбрасывает предмет.",
  "debugify.fix_explanation.mc_176559": "Не учитывает прочность предмета при сравнении изменения предмета для проверки сброса ломания блока.",
  "debugify.fix_explanation.mc-197260": "Переопределяет уровень освещения, передаваемый рендеру стойки для брони, с максимальным значением для: блока под стойкой для брони, нижней точки стойки для брони, верхней точки стойки брони и блока над стойкой брони.",
  "debugify.fix_explanation.mc-237493": "Добавляет опцию в меню телеметрии для полного отключения телеметрии. Телеметрия отключается путем переопределения всех исходящих событий телеметрии как пустого события телеметрии, которое не отправляется.",

  "debugify.fix_explanation.mc-2025": "Из-за неточности с плавающей точкой иногда хитбокс существ оказывается немного меньше, чем нужно. Если это происходит до того, как существа будут отталкиваться друг от друга, они пересекутся со стеной. Потом, когда AABB рассчитывается при загрузке чанка, они будут считаться внутри стены, где их вытолкнут. Это исправление просто записывает тег «AABB» в данные NBT существа с размерами хитбокса с двойной точностью, которые затем загружаются обратно.",
  "debugify.fix_effect.mc-2025": "Это исправление означает, что загрузка Debugify в первый раз не устранит проблему до тех пор, пока чанки не будут сохранены и загружены с помощью Debugify.",
  "debugify.fix_explanation.mc-7569": "Добавляет новую строку в конце каждого системного сообщения.",
  "debugify.fix_explanation.mc-30391": "Добавляет обработку случая, когда у кур, магмы и сумеречного скелета не должны генерироваться частицы при падении с высоты.",
  "debugify.fix_explanation.mc-69216": "Удаляет сущность удочки при переходе в режим наблюдателя.",
  "debugify.fix_explanation.mc-72151": "У волков есть особая функция, которая изменяет количество наносимого ими урона, преобразуя входной урон 0 в 0.5, это исправление проверяет, равен ли урон 0.5, и возвращает его обратно в 0.",
  "debugify.fix_explanation.mc-88371": "Устанавливает координату Y посадки дракона на 65, если центр спавна был разрушен.",
  "debugify.fix_explanation.mc-89146": "Обеспечивает строгий порядок сохранения тайловых сущностей, соответствующий порядку обновления, что позволяет начальному обновлению тайловых сущностей выполняться в правильном порядке.",
  "debugify.fix_explanation.mc-93018": "Не запускать процесс спаривания, если волк приручен.",
  "debugify.fix_explanation.mc-100991": "Уведомляет систему отслеживания урона крючком удочки о нанесении сущности 0 урона, как снежком.",
  "debugify.fix_explanation.mc-119417": "Не допускает, чтобы игрок спал, когда он переходит в режим наблюдателя."
  "debugify.fix_explanation.mc-119754": "Говорит сущностям фейерверков, что игроки не летят на элитрах, если они в режиме наблюдателя",
  "debugify.fix_explanation.mc-121706": "Существа при атаке луком вынуждены смотреть на свою цель.",
  "debugify.fix_explanation.mc-121903": "Добавляет тег NBT «LastExecuted» в командные блоки для сохранения и загрузки их последнего выполненного свойства.",
  "debugify.fix_explanation.mc-124117": "Отправляет игрокам пакеты для обновления всех их эффектов, опыта и способностей после перехода в другое измерение.",
  "debugify.fix_explanation.mc-132878": "Создаёт частицы разрушения, когда стойки для брони ломаются.",
  "debugify.fix_explanation.mc-135971": "Переопределяет поведение CTRL+Q в ячейке крафта для повторного использования CTRL+Q до тех пор, пока в ячейке крафта не останется предметов.",
  "debugify.fix_explanation.mc-155509": "Проверяет, жив ли иглобрюх перед тем, как он попытается ужалить игрока.",
  "debugify.fix_explanation.mc-160095": "Если кактус сталкивается с головкой поршня, вместо поршня рассматривается блок, который перемещается поршнем.",
  "debugify.fix_explanation.mc-179072": "Проверяет, является ли существо, которое видит крипер, врагом, прежде чем взрываться.",
  "debugify.fix_explanation.mc-183990": "При обновлении монстра проверяет, жива ли его цель, и удаляет цель, если она мертва. Эта исправление также применяется к длинному списку существ, имеющих групповые атаки, а не только к чешуйницам.",
  "debugify.fix_explanation.mc-193343": "Удаляет скорость души, если игрок в режиме наблюдателя.",
  "debugify.fix_explanation.mc-199467": "Изменяет входные данные для функций sin и cos, которые переносят входные данные с 0 на 2pi. Это предотвращает любое переполнение целого числа. Хотя этот вопрос, как сообщается, является вопросом клиента, корневая причина находится в обоих средах, поэтому он находится в общем разделе.",
  "debugify.fix_explanation.mc-200418": "Снимает маленьких жителей с цыплят после их превращения.",
  "debugify.fix_explanation.mc-206922": "Предметы с возрастом менее 9 тиков не удаляются от ударов молний.",
  "debugify.fix_explanation.mc-215530": "Сбрасывает эффект заморозки, когда игрок переходит в режим наблюдателя.",
  "debugify.fix_explanation.mc-224729": "Всегда сохраняет ProtoChunks, даже если предикат сохранения чанков возвращает значение false."
}
