{
  "debugify.name": "Debugify",
  "debugify.basic": "Sửa lỗi cơ bản",
  "debugify.gameplay": "Sửa lỗi trò chơi",
  "debugify.gameplay.warning": "CẢNH BÁO: Danh mục này chứa các bản sửa lỗi có thể là một lợi thế không công bằng!",
  "debugify.gameplay.enable_in_multiplayer": "Kích hoạt trong nhiều người chơi",
  "debugify.fix.enabled": "Đã sửa",
  "debugify.fix.disabled": "Chưa sửa",
  "debugify.fix.unavailable": "Không có sẵn",
  "debugify.error.conflict": "Bản sửa lỗi %s không tương thích với mod '%s'",
  "debugify.error.os": "%s chỉ áp dụng cho %s",
  "debugify.error.mixin_error": "Không tải được %s, hãy kiểm tra nhật ký để biết thêm thông tin.",
  "debugify.error.mixin_error.text": "Bị lỗi",
  "debugify.os.windows": "Windows",
  "debugify.os.macos": "macOS",
  "debugify.os.linux": "Linux",
  "debugify.os.solaris": "Solaris",
  "debugify.misc": "Khác",
  "debugify.misc.default_disabled": "Mặc định là Vô hiệu hóa",
  "debugify.misc.default_disabled.description": "Các bản sửa lỗi mới mặc định bị vô hiệu hóa thay vì được bật.",
  "debugify.env.client": "Máy khách",
  "debugify.env.client.desc": "Các bản sửa lỗi chỉ áp dụng trên máy khách.",
  "debugify.env.server": "Chính",
  "debugify.env.server.desc": "Các bản sửa lỗi áp dụng cho cả máy khách và máy chủ cũng như mã chung giữa chúng.",
  "debugify.no_yacl.title": "YetAnotherConfigLib chưa được cài đặt!",
  "debugify.no_yacl.description": "Để định cấu hình Debugify bằng GUI, bạn phải cài đặt %s, đây là thư viện được sử dụng để cung cấp chức năng này. Nếu không, bạn có thể định cấu hình bằng cách sử dụng tệp JSON được lưu trữ tại '%s'.",

  "debugify.mc_237493.header": "Đo từ xa bị vô hiệu hóa bởi Debugify",
  "debugify.mc_237493.line": "Bạn đã chọn '%s' trên tùy chọn đo từ xa, vì vậy Debugify đang ngăn mọi kết nối với các dịch vụ đo từ xa từ Mojang. Điều này được cung cấp bởi Debugify để sửa lỗi MC-237493.",
  "debugify.mc_237493.tooltip.off": "'%s' vô hiệu hóa hoàn toàn mọi kết nối với các dịch vụ đo từ xa của Mojang. (Debugify MC-237493)",
  "debugify.mc_237493.tooltip.minimal": "'%s' chỉ bao gồm thông tin mà Mojang cho là cần thiết.",
  "debugify.mc_237493.tooltip.all": "'%s' bao gồm tất cả phép đo từ xa tối thiểu và tùy chọn.",

  "debugify.fix_explanation.mc-55347": "Xóa tiêu đề khi ngắt kết nối.",
  "debugify.fix_explanation.mc-79545": "Kẹp mức kinh nghiệm vào giới hạn số nguyên chỉ khi kết xuất.",
  "debugify.fix_explanation.mc-93384": "Thêm chiều cao mắt vào vị trí xuất hiện hạt.",
  "debugify.fix_explanation.mc-108948": "Vấn đề là máy khách không chạy các tính toán giống như máy chủ. Khi không có ai điều khiển thuyền, máy khách không chạy vật lý trên thuyền, khiến máy khách không đồng bộ hóa. Bản sửa lỗi này chỉ yêu cầu máy khách chạy một số tính toán vật lý trên thuyền.",
  "debugify.fix_explanation.mc-111516": "Sửa đổi phép tính acos toán học để đảm bảo kết quả không lớn hơn 1.0",
  "debugify.fix_explanation.mc-112730": "Ngăn không cho đèn hiệu và các thực thể khối khác được thêm vào danh sách trình kết xuất thực thể khối cục bộ nếu chúng đã được thêm vào danh sách chung.",
  "debugify.fix_explanation.mc-122477": "Ngăn chặn hai cuộc thăm dò bàn phím đầu tiên sau khi hộp chỉnh sửa được khởi tạo, ví dụ: hộp trò chuyện.",
  "debugify.fix_explanation.mc-123739": "Sắp xếp các mục trong sách công thức theo số nhận dạng của chúng.",
  "debugify.fix_explanation.mc-143474": "Sao chép vị trí vật phẩm đã chọn khi tạo người chơi cục bộ mới sau khi hồi sinh.",
  "debugify.fix_explanation.mc-159163": "Loại bỏ dữ liệu tư thế khỏi việc xử lý gói dữ liệu thực thể.",
  "debugify.fix_effect.mc-159163": "Điều này sẽ ngăn máy khách đồng bộ hóa dữ liệu tư thế với máy chủ và hoàn toàn sử dụng máy khách để quyết định tư thế.",
  "debugify.fix_explanation.mc-162253": "Dừng cập nhật ánh sáng máy khách khi vào một đoạn khúc.",
  "debugify.fix_explanation.mc-165381": "Hủy hủy khối khi máy khách đánh rơi vật phẩm",
  "debugify.fix_explanation.mc_176559": "Không xem xét độ bền của vật phẩm khi so sánh sự thay đổi trong vật phẩm khi kiểm tra xem có nên đặt lại việc phá vỡ khối hay không.",
  "debugify.fix_explanation.mc-197260": "Ghi đè mức ánh sáng được truyền cho trình kết xuất giá đỡ áo giáp với tối đa: khối bên dưới giá đỡ áo giáp, đáy giá đỡ áo giáp, đỉnh giá đỡ áo giáp và khối bên trên giá đỡ áo giáp.",
  "debugify.fix_explanation.mc-237493": "Thêm một tùy chọn trong menu đo từ xa để tắt hoàn toàn phép đo từ xa. Đo từ xa bị vô hiệu hóa bằng cách ghi đè tất cả các sự kiện đo từ xa gửi đi thành một sự kiện đo từ xa trống, không được gửi.",

  "debugify.fix_explanation.mc-2025": "Do sự không chính xác của dấu phẩy động, đôi khi hộp sát thương của các thực thể cuối cùng nhỏ hơn một chút so với mong muốn. Sau đó, nếu điều này xảy ra trước khi các thực thể bị đẩy vào nhau, chúng sẽ giao nhau với bức tường. Sau đó, khi AABB được tính toán lại trên đoạn tải, chúng sẽ được xác định là bên trong tường, nơi chúng được đẩy. Bản sửa lỗi này chỉ cần ghi thẻ 'AABB' vào dữ liệu NBT của thực thể với kích thước hộp đánh chính xác kép, sau đó được tải lại.",
  "debugify.fix_effect.mc-2025": "Khắc phục sự cố này có nghĩa là tải Debugify lần đầu tiên sẽ không khắc phục được sự cố cho đến khi các khối được lưu và tải bằng Debugify.",
  "debugify.fix_explanation.mc-7569": "Nối thêm một dòng mới vào cuối mỗi thông báo hệ thống.",
  "debugify.fix_explanation.mc-30391": "Thêm kiểm tra trường hợp cạnh cho gà, blaze và wither để sát thương rơi sinh ra các hạt để không sinh ra chúng.",
  "debugify.fix_explanation.mc-69216": "Loại bỏ thực thể móc câu khi đổi thành khán giả.",
  "debugify.fix_explanation.mc-72151": "Sói có một chức năng tùy chỉnh để sửa đổi lượng sát thương mà chúng nhận, giúp chuyển đổi sát thương đầu vào từ 0 thành 0,5, bản sửa lỗi này kiểm tra xem sát thương có phải là 0,5 hay không và thay đổi về 0.",
  "debugify.fix_explanation.mc-88371": "Đặt vị trí hạ cánh Y của rồng ender thành 65 nếu trung tâm đã bị phá hủy.",
  "debugify.fix_explanation.mc-89146": "Cung cấp thứ tự lưu nghiêm ngặt của các thực thể khối xếp, để khớp với thứ tự cập nhật, sau đó cho phép cập nhật ban đầu các thực thể khối xếp theo đúng thứ tự.",
  "debugify.fix_explanation.mc-93018": "Chỉ bắt đầu sinh sản nếu sói đã được thuần hóa.",
  "debugify.fix_explanation.mc-100991": "Thông báo cho bộ theo dõi sát thương về một lưỡi câu bị ném ra gây sát thương cho thực thể bằng 0 sát thương, giống như quả cầu tuyết.",
  "debugify.fix_explanation.mc-119417": "Ngăn người chơi ngủ khi họ chuyển sang chế độ khán giả.",
  "debugify.fix_explanation.mc-119754": "Nói với các thực thể pháo hoa rằng người chơi không bay elytra nếu ở trong chế độ khán giả",
  "debugify.fix_explanation.mc-121706": "Các thực thể có mục tiêu tấn công bằng cung tầm xa buộc phải nhìn vào mục tiêu của chúng.",
  "debugify.fix_explanation.mc-121903": "Thêm thẻ NBT 'LastExecuted' vào các khối lệnh để lưu và tải thuộc tính được thực thi cuối cùng của chúng.",
  "debugify.fix_explanation.mc-124117": "Gửi cho người chơi các gói để cập nhật tất cả các hiệu ứng, kinh nghiệm và khả năng của họ sau khi dịch chuyển tức thời qua chiều không gian khác.",
  "debugify.fix_explanation.mc-132878": "Sinh ra các hạt vỡ khi giá đỡ áo giáp bị tổn thương.",
  "debugify.fix_explanation.mc-135971": "Ghi đè hành vi CTRL+Q trong ô chế tạo thành CTRL+Q liên tục cho đến khi không còn vật phẩm nào trong ô chế tạo.",
  "debugify.fix_explanation.mc-155509": "Kiểm tra xem cá nóc còn sống hay không trước khi cố gắng chích người chơi.",
  "debugify.fix_explanation.mc-160095": "Nếu xương rồng gặp đầu pít-tông, khối đang được chuyển động bởi pít-tông được xem xét thay vì chính pít-tông.",
  "debugify.fix_explanation.mc-179072": "Kiểm tra xem thực thể mà creeper nhìn thấy có phải là kẻ thù hay không trước khi phát nổ.",
  "debugify.fix_explanation.mc-183990": "Khi một mob được đánh dấu, nó sẽ kiểm tra xem mục tiêu của nó đã chết chưa và loại bỏ nó nếu có. Bản sửa lỗi này cũng áp dụng cho một danh sách dài các thực thể có các cuộc tấn công theo nhóm, không chỉ cá bạc.",
  "debugify.fix_explanation.mc-193343": "Loại bỏ Tốc độ linh hồn nếu người chơi đang ở chế độ khán giả.",
  "debugify.fix_explanation.mc-199467": "Sửa đổi đầu vào thành các hàm sin và cos, bao hàm đầu vào từ 0 đến 2pi. Điều này ngăn chặn bất kỳ sự cố tràn số nguyên nào xảy ra. Mặc dù sự cố này được báo cáo là sự cố của máy khách, nhưng nguyên nhân cốt lõi nằm ở cả hai môi trường, do đó, nó nằm trong tệp main.",
  "debugify.fix_explanation.mc-200418": "Tháo rời dân làng con khỏi gà khi chuyển đổi.",
  "debugify.fix_explanation.mc-206922": "Các vật phẩm có tuổi đời dưới 9 tick không bị loại bỏ khỏi sét đánh.",
  "debugify.fix_explanation.mc-215530": "Đặt lại thời gian đóng băng khi người chơi thay đổi thành chế độ khán giả.",
  "debugify.fix_explanation.mc-224729": "Luôn lưu ProtoChunks ngay cả khi vị từ lưu đoạn mã trả về sai."
